glcloud/keil_v5/ARM/PACK/.Web/SiliconLabs.EFM32GG_DFP.pdsc
      <subFamily DsubFamily="EFM32GG295">
        <book         name="Documents/efm32gg295_datasheet.pdf"      title="EFM32GG295 Data Sheet"/>
        <book         name="Documents/efm32gg295_errata.pdf"         title="EFM32GG295 Errata"/>
        <book         name="Documents/efm32gg295_errata_history.pdf" title="EFM32GG295 Errata History"/>
        <!-- *************************  Device 'EFM32GG295F1024'  ***************************** -->
        <device Dname="EFM32GG295F1024">
          <compile header="Device/SiliconLabs/EFM32GG/Include/em_device.h"  define="EFM32GG295F1024"/>
          <debug      svd="SVD/EFM32GG/EFM32GG295F1024.svd"/>
          <memory     id="IROM1"                start="0x00000000"  size="0x00100000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                start="0x20000000"  size="0x00020000"  init   ="0"   default="1"/>
          <algorithm  name="Flash/EFM32GG.FLM"  start="0x00000000"  size="0x00100000"  RAMstart="0x20000000" RAMsize="0x8000" default="1" style="Keil"/>
          <algorithm  name="Flash/FlashEFM32.flash"  start="0x00000000"  size="0x00100000"  default="0"  style="IAR"/>
        </device>

        <!-- *************************  Device 'EFM32GG295F512'  ***************************** -->
        <device Dname="EFM32GG295F512">
          <compile header="Device/SiliconLabs/EFM32GG/Include/em_device.h"  define="EFM32GG295F512"/>
          <debug      svd="SVD/EFM32GG/EFM32GG295F512.svd"/>
          <memory     id="IROM1"                start="0x00000000"  size="0x00080000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                start="0x20000000"  size="0x00020000"  init   ="0"   default="1"/>
          <algorithm  name="Flash/EFM32GG.FLM"  start="0x00000000"  size="0x00080000"  RAMstart="0x20000000" RAMsize="0x8000" default="1" style="Keil"/>
          <algorithm  name="Flash/FlashEFM32.flash"  start="0x00000000"  size="0x00080000"  default="0"  style="IAR"/>
        </device>

      </subFamily>

      <subFamily DsubFamily="EFM32GG330">
        <book         name="Documents/efm32gg330_datasheet.pdf"      title="EFM32GG330 Data Sheet"/>
        <book         name="Documents/efm32gg330_errata.pdf"         title="EFM32GG330 Errata"/>
        <book         name="Documents/efm32gg330_errata_history.pdf" title="EFM32GG330 Errata History"/>
        <!-- *************************  Device 'EFM32GG330F1024'  ***************************** -->
        <device Dname="EFM32GG330F1024">
          <compile header="Device/SiliconLabs/EFM32GG/Include/em_device.h"  define="EFM32GG330F1024"/>
          <debug      svd="SVD/EFM32GG/EFM32GG330F1024.svd"/>
          <memory     id="IROM1"                start="0x00000000"  size="0x00100000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                start="0x20000000"  size="0x00020000"  init   ="0"   default="1"/>
          <algorithm  name="Flash/EFM32GG.FLM"  start="0x00000000"  size="0x00100000"  RAMstart="0x20000000" RAMsize="0x8000" default="1" style="Keil"/>
          <algorithm  name="Flash/FlashEFM32.flash"  start="0x00000000"  size="0x00100000"  default="0"  style="IAR"/>
        </device>

        <!-- *************************  Device 'EFM32GG330F512'  ***************************** -->
        <device Dname="EFM32GG330F512">
          <compile header="Device/SiliconLabs/EFM32GG/Include/em_device.h"  define="EFM32GG330F512"/>
          <debug      svd="SVD/EFM32GG/EFM32GG330F512.svd"/>
          <memory     id="IROM1"                start="0x00000000"  size="0x00080000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                start="0x20000000"  size="0x00020000"  init   ="0"   default="1"/>
          <algorithm  name="Flash/EFM32GG.FLM"  start="0x00000000"  size="0x00080000"  RAMstart="0x20000000" RAMsize="0x8000" default="1" style="Keil"/>
          <algorithm  name="Flash/FlashEFM32.flash"  start="0x00000000"  size="0x00080000"  default="0"  style="IAR"/>
        </device>

      </subFamily>

      <subFamily DsubFamily="EFM32GG332">
        <book         name="Documents/efm32gg332_datasheet.pdf"      title="EFM32GG332 Data Sheet"/>
        <book         name="Documents/efm32gg332_errata.pdf"         title="EFM32GG332 Errata"/>
        <book         name="Documents/efm32gg332_errata_history.pdf" title="EFM32GG332 Errata History"/>
        <!-- *************************  Device 'EFM32GG332F1024'  ***************************** -->
        <device Dname="EFM32GG332F1024">
          <compile header="Device/SiliconLabs/EFM32GG/Include/em_device.h"  define="EFM32GG332F1024"/>
          <debug      svd="SVD/EFM32GG/EFM32GG332F1024.svd"/>
          <memory     id="IROM1"                start="0x00000000"  size="0x00100000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                start="0x20000000"  size="0x00020000"  init   ="0"   default="1"/>
          <algorithm  name="Flash/EFM32GG.FLM"  start="0x00000000"  size="0x00100000"  RAMstart="0x20000000" RAMsize="0x8000" default="1" style="Keil"/>
          <algorithm  name="Flash/FlashEFM32.flash"  start="0x00000000"  size="0x00100000"  default="0"  style="IAR"/>
        </device>

        <!-- *************************  Device 'EFM32GG332F512'  ***************************** -->
        <device Dname="EFM32GG332F512">
          <compile header="Device/SiliconLabs/EFM32GG/Include/em_device.h"  define="EFM32GG332F512"/>
          <debug      svd="SVD/EFM32GG/EFM32GG332F512.svd"/>
          <memory     id="IROM1"                start="0x00000000"  size="0x00080000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                start="0x20000000"  size="0x00020000"  init   ="0"   default="1"/>
          <algorithm  name="Flash/EFM32GG.FLM"  start="0x00000000"  size="0x00080000"  RAMstart="0x20000000" RAMsize="0x8000" default="1" style="Keil"/>
          <algorithm  name="Flash/FlashEFM32.flash"  start="0x00000000"  size="0x00080000"  default="0"  style="IAR"/>
        </device>

      </subFamily>

      <subFamily DsubFamily="EFM32GG380">
        <book         name="Documents/efm32gg380_datasheet.pdf"      title="EFM32GG380 Data Sheet"/>
        <book         name="Documents/efm32gg380_errata.pdf"         title="EFM32GG380 Errata"/>
        <book         name="Documents/efm32gg380_errata_history.pdf" title="EFM32GG380 Errata History"/>
        <!-- *************************  Device 'EFM32GG380F1024'  ***************************** -->
        <device Dname="EFM32GG380F1024">
          <compile header="Device/SiliconLabs/EFM32GG/Include/em_device.h"  define="EFM32GG380F1024"/>
          <debug      svd="SVD/EFM32GG/EFM32GG380F1024.svd"/>
          <memory     id="IROM1"                start="0x00000000"  size="0x00100000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                start="0x20000000"  size="0x00020000"  init   ="0"   default="1"/>
          <algorithm  name="Flash/EFM32GG.FLM"  start="0x00000000"  size="0x00100000"  RAMstart="0x20000000" RAMsize="0x8000" default="1" style="Keil"/>
          <algorithm  name="Flash/FlashEFM32.flash"  start="0x00000000"  size="0x00100000"  default="0"  style="IAR"/>
        </device>

