glcloud/keil_v5/ARM/PACK/.Web/SiliconLabs.EFM32GG_DFP.pdsc
        <!-- *************************  Device 'EFM32GG890F512'  ***************************** -->
        <device Dname="EFM32GG890F512">
          <compile header="Device/SiliconLabs/EFM32GG/Include/em_device.h"  define="EFM32GG890F512"/>
          <debug      svd="SVD/EFM32GG/EFM32GG890F512.svd"/>
          <memory     id="IROM1"                start="0x00000000"  size="0x00080000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                start="0x20000000"  size="0x00020000"  init   ="0"   default="1"/>
          <algorithm  name="Flash/EFM32GG.FLM"  start="0x00000000"  size="0x00080000"  RAMstart="0x20000000" RAMsize="0x8000" default="1" style="Keil"/>
          <algorithm  name="Flash/FlashEFM32.flash"  start="0x00000000"  size="0x00080000"  default="0"  style="IAR"/>
        </device>

      </subFamily>

      <subFamily DsubFamily="EFM32GG895">
        <book         name="Documents/efm32gg895_datasheet.pdf"      title="EFM32GG895 Data Sheet"/>
        <book         name="Documents/efm32gg895_errata.pdf"         title="EFM32GG895 Errata"/>
        <book         name="Documents/efm32gg895_errata_history.pdf" title="EFM32GG895 Errata History"/>
        <!-- *************************  Device 'EFM32GG895F1024'  ***************************** -->
        <device Dname="EFM32GG895F1024">
          <compile header="Device/SiliconLabs/EFM32GG/Include/em_device.h"  define="EFM32GG895F1024"/>
          <debug      svd="SVD/EFM32GG/EFM32GG895F1024.svd"/>
          <memory     id="IROM1"                start="0x00000000"  size="0x00100000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                start="0x20000000"  size="0x00020000"  init   ="0"   default="1"/>
          <algorithm  name="Flash/EFM32GG.FLM"  start="0x00000000"  size="0x00100000"  RAMstart="0x20000000" RAMsize="0x8000" default="1" style="Keil"/>
          <algorithm  name="Flash/FlashEFM32.flash"  start="0x00000000"  size="0x00100000"  default="0"  style="IAR"/>
        </device>

        <!-- *************************  Device 'EFM32GG895F512'  ***************************** -->
        <device Dname="EFM32GG895F512">
          <compile header="Device/SiliconLabs/EFM32GG/Include/em_device.h"  define="EFM32GG895F512"/>
          <debug      svd="SVD/EFM32GG/EFM32GG895F512.svd"/>
          <memory     id="IROM1"                start="0x00000000"  size="0x00080000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                start="0x20000000"  size="0x00020000"  init   ="0"   default="1"/>
          <algorithm  name="Flash/EFM32GG.FLM"  start="0x00000000"  size="0x00080000"  RAMstart="0x20000000" RAMsize="0x8000" default="1" style="Keil"/>
          <algorithm  name="Flash/FlashEFM32.flash"  start="0x00000000"  size="0x00080000"  default="0"  style="IAR"/>
        </device>

      </subFamily>

      <subFamily DsubFamily="EFM32GG900">
        <book         name="Documents/efm32gg900_datasheet.pdf"      title="EFM32GG900 Data Sheet"/>
        <book         name="Documents/efm32gg900_errata.pdf"         title="EFM32GG900 Errata"/>
        <book         name="Documents/efm32gg900_errata_history.pdf" title="EFM32GG900 Errata History"/>
        <!-- *************************  Device 'EFM32GG900F1024'  ***************************** -->
        <device Dname="EFM32GG900F1024">
          <compile header="Device/SiliconLabs/EFM32GG/Include/em_device.h"  define="EFM32GG900F1024"/>
          <debug      svd="SVD/EFM32GG/EFM32GG900F1024.svd"/>
          <memory     id="IROM1"                start="0x00000000"  size="0x00100000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                start="0x20000000"  size="0x00020000"  init   ="0"   default="1"/>
          <algorithm  name="Flash/EFM32GG.FLM"  start="0x00000000"  size="0x00100000"  RAMstart="0x20000000" RAMsize="0x8000" default="1" style="Keil"/>
          <algorithm  name="Flash/FlashEFM32.flash"  start="0x00000000"  size="0x00100000"  default="0"  style="IAR"/>
        </device>

        <!-- *************************  Device 'EFM32GG900F512'  ***************************** -->
        <device Dname="EFM32GG900F512">
          <compile header="Device/SiliconLabs/EFM32GG/Include/em_device.h"  define="EFM32GG900F512"/>
          <debug      svd="SVD/EFM32GG/EFM32GG900F512.svd"/>
          <memory     id="IROM1"                start="0x00000000"  size="0x00080000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                start="0x20000000"  size="0x00020000"  init   ="0"   default="1"/>
          <algorithm  name="Flash/EFM32GG.FLM"  start="0x00000000"  size="0x00080000"  RAMstart="0x20000000" RAMsize="0x8000" default="1" style="Keil"/>
          <algorithm  name="Flash/FlashEFM32.flash"  start="0x00000000"  size="0x00080000"  default="0"  style="IAR"/>
        </device>

      </subFamily>

      <subFamily DsubFamily="EFM32GG940">
        <book         name="Documents/efm32gg940_datasheet.pdf"      title="EFM32GG940 Data Sheet"/>
        <book         name="Documents/efm32gg940_errata.pdf"         title="EFM32GG940 Errata"/>
        <book         name="Documents/efm32gg940_errata_history.pdf" title="EFM32GG940 Errata History"/>
        <!-- *************************  Device 'EFM32GG940F1024'  ***************************** -->
        <device Dname="EFM32GG940F1024">
          <compile header="Device/SiliconLabs/EFM32GG/Include/em_device.h"  define="EFM32GG940F1024"/>
          <debug      svd="SVD/EFM32GG/EFM32GG940F1024.svd"/>
          <memory     id="IROM1"                start="0x00000000"  size="0x00100000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                start="0x20000000"  size="0x00020000"  init   ="0"   default="1"/>
          <algorithm  name="Flash/EFM32GG.FLM"  start="0x00000000"  size="0x00100000"  RAMstart="0x20000000" RAMsize="0x8000" default="1" style="Keil"/>
          <algorithm  name="Flash/FlashEFM32.flash"  start="0x00000000"  size="0x00100000"  default="0"  style="IAR"/>
        </device>

        <!-- *************************  Device 'EFM32GG940F512'  ***************************** -->
        <device Dname="EFM32GG940F512">
          <compile header="Device/SiliconLabs/EFM32GG/Include/em_device.h"  define="EFM32GG940F512"/>
          <debug      svd="SVD/EFM32GG/EFM32GG940F512.svd"/>
          <memory     id="IROM1"                start="0x00000000"  size="0x00080000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                start="0x20000000"  size="0x00020000"  init   ="0"   default="1"/>
          <algorithm  name="Flash/EFM32GG.FLM"  start="0x00000000"  size="0x00080000"  RAMstart="0x20000000" RAMsize="0x8000" default="1" style="Keil"/>
          <algorithm  name="Flash/FlashEFM32.flash"  start="0x00000000"  size="0x00080000"  default="0"  style="IAR"/>
        </device>

      </subFamily>

      <subFamily DsubFamily="EFM32GG942">
        <book         name="Documents/efm32gg942_datasheet.pdf"      title="EFM32GG942 Data Sheet"/>
        <book         name="Documents/efm32gg942_errata.pdf"         title="EFM32GG942 Errata"/>
        <book         name="Documents/efm32gg942_errata_history.pdf" title="EFM32GG942 Errata History"/>
        <!-- *************************  Device 'EFM32GG942F1024'  ***************************** -->
        <device Dname="EFM32GG942F1024">
          <compile header="Device/SiliconLabs/EFM32GG/Include/em_device.h"  define="EFM32GG942F1024"/>
          <debug      svd="SVD/EFM32GG/EFM32GG942F1024.svd"/>
          <memory     id="IROM1"                start="0x00000000"  size="0x00100000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                start="0x20000000"  size="0x00020000"  init   ="0"   default="1"/>
          <algorithm  name="Flash/EFM32GG.FLM"  start="0x00000000"  size="0x00100000"  RAMstart="0x20000000" RAMsize="0x8000" default="1" style="Keil"/>
          <algorithm  name="Flash/FlashEFM32.flash"  start="0x00000000"  size="0x00100000"  default="0"  style="IAR"/>
        </device>

        <!-- *************************  Device 'EFM32GG942F512'  ***************************** -->
        <device Dname="EFM32GG942F512">
          <compile header="Device/SiliconLabs/EFM32GG/Include/em_device.h"  define="EFM32GG942F512"/>
          <debug      svd="SVD/EFM32GG/EFM32GG942F512.svd"/>
          <memory     id="IROM1"                start="0x00000000"  size="0x00080000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                start="0x20000000"  size="0x00020000"  init   ="0"   default="1"/>
          <algorithm  name="Flash/EFM32GG.FLM"  start="0x00000000"  size="0x00080000"  RAMstart="0x20000000" RAMsize="0x8000" default="1" style="Keil"/>
          <algorithm  name="Flash/FlashEFM32.flash"  start="0x00000000"  size="0x00080000"  default="0"  style="IAR"/>
        </device>

      </subFamily>

      <subFamily DsubFamily="EFM32GG980">
        <book         name="Documents/efm32gg980_datasheet.pdf"      title="EFM32GG980 Data Sheet"/>
        <book         name="Documents/efm32gg980_errata.pdf"         title="EFM32GG980 Errata"/>
        <book         name="Documents/efm32gg980_errata_history.pdf" title="EFM32GG980 Errata History"/>
        <!-- *************************  Device 'EFM32GG980F1024'  ***************************** -->
        <device Dname="EFM32GG980F1024">
          <compile header="Device/SiliconLabs/EFM32GG/Include/em_device.h"  define="EFM32GG980F1024"/>
          <debug      svd="SVD/EFM32GG/EFM32GG980F1024.svd"/>
          <memory     id="IROM1"                start="0x00000000"  size="0x00100000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                start="0x20000000"  size="0x00020000"  init   ="0"   default="1"/>
          <algorithm  name="Flash/EFM32GG.FLM"  start="0x00000000"  size="0x00100000"  RAMstart="0x20000000" RAMsize="0x8000" default="1" style="Keil"/>
          <algorithm  name="Flash/FlashEFM32.flash"  start="0x00000000"  size="0x00100000"  default="0"  style="IAR"/>
        </device>

        <!-- *************************  Device 'EFM32GG980F512'  ***************************** -->
        <device Dname="EFM32GG980F512">
          <compile header="Device/SiliconLabs/EFM32GG/Include/em_device.h"  define="EFM32GG980F512"/>
          <debug      svd="SVD/EFM32GG/EFM32GG980F512.svd"/>
          <memory     id="IROM1"                start="0x00000000"  size="0x00080000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                start="0x20000000"  size="0x00020000"  init   ="0"   default="1"/>
          <algorithm  name="Flash/EFM32GG.FLM"  start="0x00000000"  size="0x00080000"  RAMstart="0x20000000" RAMsize="0x8000" default="1" style="Keil"/>
          <algorithm  name="Flash/FlashEFM32.flash"  start="0x00000000"  size="0x00080000"  default="0"  style="IAR"/>
        </device>

      </subFamily>

      <subFamily DsubFamily="EFM32GG990">
        <book         name="Documents/efm32gg990_datasheet.pdf"      title="EFM32GG990 Data Sheet"/>
        <book         name="Documents/efm32gg990_errata.pdf"         title="EFM32GG990 Errata"/>
        <book         name="Documents/efm32gg990_errata_history.pdf" title="EFM32GG990 Errata History"/>
        <!-- *************************  Device 'EFM32GG990F1024'  ***************************** -->
        <device Dname="EFM32GG990F1024">
          <compile header="Device/SiliconLabs/EFM32GG/Include/em_device.h"  define="EFM32GG990F1024"/>
          <debug      svd="SVD/EFM32GG/EFM32GG990F1024.svd"/>
          <memory     id="IROM1"                start="0x00000000"  size="0x00100000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                start="0x20000000"  size="0x00020000"  init   ="0"   default="1"/>
          <algorithm  name="Flash/EFM32GG.FLM"  start="0x00000000"  size="0x00100000"  RAMstart="0x20000000" RAMsize="0x8000" default="1" style="Keil"/>
          <algorithm  name="Flash/FlashEFM32.flash"  start="0x00000000"  size="0x00100000"  default="0"  style="IAR"/>
        </device>

        <!-- *************************  Device 'EFM32GG990F512'  ***************************** -->
        <device Dname="EFM32GG990F512">
          <compile header="Device/SiliconLabs/EFM32GG/Include/em_device.h"  define="EFM32GG990F512"/>
          <debug      svd="SVD/EFM32GG/EFM32GG990F512.svd"/>
          <memory     id="IROM1"                start="0x00000000"  size="0x00080000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                start="0x20000000"  size="0x00020000"  init   ="0"   default="1"/>
          <algorithm  name="Flash/EFM32GG.FLM"  start="0x00000000"  size="0x00080000"  RAMstart="0x20000000" RAMsize="0x8000" default="1" style="Keil"/>
          <algorithm  name="Flash/FlashEFM32.flash"  start="0x00000000"  size="0x00080000"  default="0"  style="IAR"/>
        </device>

      </subFamily>

      <subFamily DsubFamily="EFM32GG995">
        <book         name="Documents/efm32gg995_datasheet.pdf"      title="EFM32GG995 Data Sheet"/>
        <book         name="Documents/efm32gg995_errata.pdf"         title="EFM32GG995 Errata"/>
        <book         name="Documents/efm32gg995_errata_history.pdf" title="EFM32GG995 Errata History"/>
        <!-- *************************  Device 'EFM32GG995F1024'  ***************************** -->
        <device Dname="EFM32GG995F1024">
          <compile header="Device/SiliconLabs/EFM32GG/Include/em_device.h"  define="EFM32GG995F1024"/>
          <debug      svd="SVD/EFM32GG/EFM32GG995F1024.svd"/>
          <memory     id="IROM1"                start="0x00000000"  size="0x00100000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                start="0x20000000"  size="0x00020000"  init   ="0"   default="1"/>
          <algorithm  name="Flash/EFM32GG.FLM"  start="0x00000000"  size="0x00100000"  RAMstart="0x20000000" RAMsize="0x8000" default="1" style="Keil"/>
          <algorithm  name="Flash/FlashEFM32.flash"  start="0x00000000"  size="0x00100000"  default="0"  style="IAR"/>
        </device>

